#include <iostream>
#include <algorithm>

void findMedian(int nums[], int size) {
    // Сортировка вектора
    std::sort(nums, nums + size);

    // Нахождение медианы
    double median;
    if (size % 2 == 0) {
        median = (nums[size / 2 - 1] + nums[size / 2]) / 2.0;
    }
    else {
        median = nums[size / 2];
    }

    // Вывод медианы в консоль
    std::cout << "Медиана: " << median << std::endl;
}

int main() {
    setlocale(LC_ALL, "Russian");
    int nums[] = { 7, 2, 18, 15, 11};
    int size = sizeof(nums) / sizeof(nums[0]);

    // Нахождение медианы в векторе
    findMedian(nums, size);

    return 0;
}


/*
+---------------------+
| Начало программы    |
+---------------------+
          |
          V
+---------------------+
| Ввод вектора чисел  |
+---------------------+
          |
          V
+---------------------+
| Сортировка вектора   |
+---------------------+
          |
          V
+---------------------+
| Нахождение медианы   |
+---------------------+
          |
          V
+---------------------+
| Вывод медианы в консоль|
+---------------------+
          |
          V
+---------------------+
| Конец программы      |
+---------------------+

*/
