#include <iostream>

void findPairsWithSum(int nums[], int size, int targetSum) {
    for (int i = 0; i < size; i++) {
        for (int j = i + 1; j < size; j++) {
            if (nums[i] + nums[j] == targetSum) {
                std::cout << "[" << i << "," << j << "]" << std::endl;
            }
        }
    }
}

int main() {
    int nums[] = { 2, 7, 11, 15 };
    int targetSum = 9;
    int size = sizeof(nums) / sizeof(nums[0]);

    // Поиск пар чисел, сумма которых равна targetSum
    findPairsWithSum(nums, size, targetSum);

    return 0;
}


/*
+---------------------+
| Начало программы    |
+---------------------+
          |
          V
+---------------------+
| Ввод массива чисел  |
+---------------------+
          |
          V
+---------------------+
| Ввод заданной суммы  |
+---------------------+
          |
          V
+---------------------+
| Поиск пар чисел, сумма|
| которых равна заданной|
+---------------------+
          |
          V
+---------------------+
| Вывод найденных пар в |
| консоль               |
+---------------------+
          |
          V
+---------------------+
| Конец программы      |
+---------------------+

*/
